Repository: renn999/Wordplurk-improve
Catalog: language/wordplurk-improve-*.po
Languages: ro_ro

source: Please check your Plurk username and password there is something wrong with pre login
ro_ro: Vă rugăm să verificaţi numele de utilizator si parola Plurk nu este ceva în neregulă cu autentificare pre

source: If you have bitly pro just select bit.ly or j.mp are the same.
ro_ro: Dacă aveţi bitly bit.ly pro doar selectaţi sau j.mp sunt aceleaşi.

source: Use Wordpress 3.0 wp_get_shortlink function to generate short url.
ro_ro: Funcţia Wordpress 3.0 wp_get_shortlink pentru a genera URL-ul scurt.

source: Settings
ro_ro: Setări

source: Please enter your Plurk username and password below. All fields are required.
ro_ro: Vă rugăm introduceţi numele de utilizator şi parola Plurk de mai jos. Toate câmpurile sunt obligatorii.

source: Username
ro_ro: Numele de utilizator

source: Enter the username of the Plurk account you want to post updates to.
ro_ro: Introduceţi numele contului Plurk doriţi să înregistraţi actualizări.

source: Password
ro_ro: Parola

source: Enter the password of the Plurk account entered above.
ro_ro: Introduceţi parola contului Plurk introdus mai sus.

source: Enter the Api Key of the Plurk account entered above.
ro_ro: Introduceţi cheia Api contului Plurk introdus mai sus.

source: Wordplurk Template
ro_ro: Wordplurk şablon

source: What template do you want to show on Plurk.
ro_ro: Ce şablon îl Arată pe Plurk.

source: Post Title
ro_ro: Post titlu

source: Part of the Post
ro_ro: Parte de la Post

source: Qualifier
ro_ro: Calificare

source: loves
ro_ro: iubeşte

source: likes
ro_ro: îi place

source: shares
ro_ro: acţiuni

source: gives
ro_ro: oferă

source: hates
ro_ro: urăşte

source: wants
ro_ro: vrea

source: has
ro_ro: a

source: will
ro_ro: va

source: asks
ro_ro: întreabă

source: wishes
ro_ro: doreşte

source: was
ro_ro: a fost

source: feels
ro_ro: se simte

source: thinks
ro_ro: crede

source: says
ro_ro: spune

source: is
ro_ro: este

source: hopes
ro_ro: speră

source: needs
ro_ro: nevoile

source: wonders
ro_ro: minuni

source: Select the Qualifier of the Plurk account entered above.
ro_ro: Selectaţi calificativ de cont Plurk introdus mai sus.

source: language set
ro_ro: limba set

source: Select the language set of the Plurk account entered above.
ro_ro: Selectaţi setul de limba contului Plurk introdus mai sus.

source: Short url
ro_ro: URL-ul scurt

source: Using the shorturl service to short post url.
ro_ro: Utilizând serviciul de shorturl post scurt URL-ul.

source: Short url Username
ro_ro: Scurt URL-ul de utilizator

source: You need to fill in the username to enable the Short URL service.
ro_ro: Trebuie să completaţi numele de utilizator pentru a permite serviciului de URL-ul scurt.

source: Short url API key
ro_ro: Scurt URL-ul API cheie

source: You need to fill in the API KEY to enable the Short URL service
ro_ro: Trebuie să completaţi API-cheie pentru a activa serviciul de URL-ul scurt

source: Post Plurk Responses
ro_ro: Răspuns de la post Plurk

source: This select will show the Plurk Responses after the post
ro_ro: Selectaţi acest va arăta răspunsurile Plurk după post

source: Plurk Responses cache time
ro_ro: Plurk răspunsuri cache timp

source: Because of API calls limit is 50.000 calls pr. day, Plurk Responses cache time have to according to site traffic to make the best setting.
ro_ro: Din cauza limitei de API apeluri este de 50.000 de apeluri pr. zi, timp Plurk Răspunsuri cache-ul trebuie să în conformitate cu traficul site-ul pentru a face cea mai buna setare.

source: Save Changes
ro_ro: Salvaţi modificările

source: There are something wrong with the Curl test at your server, please check it was install and enabled, or contact your server admin
ro_ro: Există ceva în neregulă cu testul Curl de la server-ul dvs., vă rugăm să verificaţi a fost de instalare şi activat, sau contactaţi administratorul de server

source: Please enter your Plurk username and password on the <a href="%1$s" title="WordPlurk Settings">WordPlurk Settings page</a>.
ro_ro: Vă rugăm introduceţi numele de utilizator şi parola pe Plurk <a href="%1$s" title="WordPlurk Settings"> WordPlurk pagina Setări </a>.

source: WordPlurk-improve was detected update. Please go on the <a href="%1$s" title="WordPlurk Settings">WordPlurk Settings page</a> and click 'Save Changes' to finish update
ro_ro: WordPlurk-îmbunătăţirea a fost detectat de actualizare. Vă rugăm să mergeţi pe <a href="%1$s" title="WordPlurk Settings"> WordPlurk pagina Setări </a> şi faceţi clic pe "Salvaţi modificările" pentru a finaliza actualizarea

source: Wordplurk improve
ro_ro: Wordplurk îmbunătăţirea

source: Do not Plurk this post. (if the post hes been plurked, the plurk will be delete.)
ro_ro: Nu Plurk acest post. (în cazul în care postul a fost HES plurked, plurk va fi şterge.)

source: this post has %d plurk responses,
ro_ro: acest post a răspuns la plurk de %d,

source: <a href="http://www.plurk.com/p/%s">click here</a> to plurk page
ro_ro: <a href="http://www.plurk.com/p/%s"> click aici</a> la pagina plurk

source: This post doesn't have any plurk response,
ro_ro: Acest post nu are nici un răspuns plurk,
